Ran Plan for project: `k8s-the-hard-way-compute-engine` dir: `k8s-the-hard-way` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # google_compute_firewall.external will be destroyed
- resource "google_compute_firewall" "external" {
      - creation_timestamp      = "2020-01-26T21:48:30.012-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - enable_logging          = false -> null
      - id                      = "projects/production-257013/global/firewalls/allow-common-external" -> null
      - name                    = "allow-common-external" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/production-257013/global/networks/common" -> null
      - priority                = 1000 -> null
      - project                 = "production-257013" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/production-257013/global/firewalls/allow-common-external" -> null
      - source_ranges           = [
          - "0.0.0.0/0",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [
          - "external",
        ] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - allow {
          - ports    = [
              - "22",
              - "443",
              - "6443",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # google_compute_firewall.google-health-check will be destroyed
- resource "google_compute_firewall" "google-health-check" {
      - creation_timestamp      = "2020-01-26T21:48:30.035-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - enable_logging          = false -> null
      - id                      = "projects/production-257013/global/firewalls/allow-common-health-check" -> null
      - name                    = "allow-common-health-check" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/production-257013/global/networks/common" -> null
      - priority                = 1000 -> null
      - project                 = "production-257013" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/production-257013/global/firewalls/allow-common-health-check" -> null
      - source_ranges           = [
          - "130.211.0.0/22",
          - "209.85.152.0/22",
          - "209.85.204.0/22",
          - "35.191.0.0/16",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [
          - "google-health-check",
        ] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - allow {
          - ports    = [
              - "80",
              - "443",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # google_compute_firewall.internal will be destroyed
- resource "google_compute_firewall" "internal" {
      - creation_timestamp      = "2020-01-26T21:48:30.223-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - enable_logging          = false -> null
      - id                      = "projects/production-257013/global/firewalls/allow-common-internal" -> null
      - name                    = "allow-common-internal" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/production-257013/global/networks/common" -> null
      - priority                = 1000 -> null
      - project                 = "production-257013" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/production-257013/global/firewalls/allow-common-internal" -> null
      - source_ranges           = [
          - "10.200.0.0/16",
          - "10.252.0.0/16",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [
          - "internal",
        ] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - allow {
          - ports    = [] -> null
          - protocol = "icmp" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "tcp" -> null
        }
      - allow {
          - ports    = [] -> null
          - protocol = "udp" -> null
        }
    }

  # google_compute_instance.master[0] will be created
+ resource "google_compute_instance" "master" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-master-0"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.10"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.master[1] will be created
+ resource "google_compute_instance" "master" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-master-1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.11"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.master[2] will be created
+ resource "google_compute_instance" "master" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-master-2"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.12"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.worker[0] will be created
+ resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-worker-0"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.100"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.worker[1] will be created
+ resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-worker-1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.101"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.worker[2] will be created
+ resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-2"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "kube-worker-2"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes",
          + "master",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = (known after apply)

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-1804-lts"
              + labels = (known after apply)
              + size   = 100
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "common"
          + network_ip         = "10.252.100.102"
          + subnetwork         = "kubernetes"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_network.vpc will be destroyed
- resource "google_compute_network" "vpc" {
      - auto_create_subnetworks         = false -> null
      - delete_default_routes_on_create = true -> null
      - id                              = "projects/production-257013/global/networks/common" -> null
      - name                            = "common" -> null
      - project                         = "production-257013" -> null
      - routing_mode                    = "GLOBAL" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/production-257013/global/networks/common" -> null
    }

  # google_compute_subnetwork.kubernetes will be destroyed
- resource "google_compute_subnetwork" "kubernetes" {
      - creation_timestamp       = "2020-01-26T21:48:30.323-08:00" -> null
      - gateway_address          = "10.252.100.1" -> null
      - id                       = "projects/production-257013/regions/asia-southeast1/subnetworks/kubernetes" -> null
      - ip_cidr_range            = "10.252.100.0/24" -> null
      - name                     = "kubernetes" -> null
      - network                  = "https://www.googleapis.com/compute/v1/projects/production-257013/global/networks/common" -> null
      - private_ip_google_access = false -> null
      - project                  = "production-257013" -> null
      - region                   = "asia-southeast1" -> null
      - secondary_ip_range       = [] -> null
      - self_link                = "https://www.googleapis.com/compute/v1/projects/production-257013/regions/asia-southeast1/subnetworks/kubernetes" -> null
    }

  # random_shuffle.az will be created
+ resource "random_shuffle" "az" {
      + id           = (known after apply)
      + input        = [
          + "asia-southeast1-a",
          + "asia-southeast1-b",
          + "asia-southeast1-c",
        ]
      + result       = (known after apply)
      + result_count = 1
    }

Plan: 7 to add, 0 to change, 5 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p k8s-the-hard-way-compute-engine`
* :put_litter_in_its_place: To **delete** this plan click [here](https://62c017ed.ngrok.io/lock?id=ardikabs%252Fatlantica-project%252Fk8s-the-hard-way%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p k8s-the-hard-way-compute-engine`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
